class Big_O {
    /*

    объяснение big O

    главная идея которую несет в себе big O это то что
    от ПЕРЕДАВАЕМЫХ ПАРАМЕТРОВ зависит КОЛИЧЕСТВО ОПЕРАЦИЙ,
    которые будут выполнены перед тем как алгоритм завершится

    Если алгоритм зависит более чем от одного аргумента, то указываем их все

    O(N) // О от N , где N это размер массива, данная метрика относится к итерациям по спискам

    1. O(1)         // константа
    2. O(log N)     // логарифмическая
    3. O(N)         // линейная
    4. O(√N)         // сублинейная
    5. O(N * log N) // линейно логарифмическая
    6. O(N²)        // квадратичная
    7. O(2^N)        // экспоненциальная
    8. O(N!)        // факториальная

    Ме́трика это мера
    позволяющая получить численное значение некоторого свойства программного обеспечения
    или его спецификаций.

    К bubble sort относится такая метрика как O(N*N) == O(N2)

    */

}